catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
cweijan.vscode-office
github.copilot
github.copilot-chat
mads-hartmann.bash-ide-vscode
marus25.cortex-debug
mcu-debug.debug-tracker-vscode
mcu-debug.memory-view
mcu-debug.peripheral-viewer
mcu-debug.rtos-views
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.vscode-serial-monitor
paulober.pico-w-go
raspberry-pi.raspberry-pi-pico
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscodevim.vim
